In [1]:
import pandas as pd

In [2]:
customers_raw = pd.read_csv('../Data/customers.csv')
customers_raw

      Name   Age  Followers     Income Sign Up Date Discount  Education Level
0     Aria  25.0        0.0   $45,000       5/18/23      Yes          College
1    Chord  19.0       12.0   $28,000       8/23/23      Yes      High School
2  Harmony  26.0        NaN  $120,000       4/25/23       No  Graduate School
3   Melody  47.0        NaN  $450,000        5/5/23       No          College
4     Reed  52.0        0.0   $75,000       6/14/23      Yes      High School
5   Selena   NaN        1.0   $62,000       8/26/23       No          College
6  Stefani   NaN        NaN   $81,000       9/24/23       No          College
7   Taylor  33.0       52.0   $60,000        9/8/23       No      High School

In [3]:
customers = customers_raw.copy()
customers

      Name   Age  Followers     Income Sign Up Date Discount  Education Level
0     Aria  25.0        0.0   $45,000       5/18/23      Yes          College
1    Chord  19.0       12.0   $28,000       8/23/23      Yes      High School
2  Harmony  26.0        NaN  $120,000       4/25/23       No  Graduate School
3   Melody  47.0        NaN  $450,000        5/5/23       No          College
4     Reed  52.0        0.0   $75,000       6/14/23      Yes      High School
5   Selena   NaN        1.0   $62,000       8/26/23       No          College
6  Stefani   NaN        NaN   $81,000       9/24/23       No          College
7   Taylor  33.0       52.0   $60,000        9/8/23       No      High School

In [4]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             8 non-null      object
 1   Age              6 non-null      float64
 2   Followers        5 non-null      float64
 3   Income           8 non-null      object
 4   Sign Up Date     8 non-null      object
 5   Discount         8 non-null      object
 6   Education Level  8 non-null      object
dtypes: float64(2), object(5)
memory usage: 580.0+ bytes

In [7]:
customers.isna().any()

Name               False
Age                 True
Followers           True
Income             False
Sign Up Date       False
Discount           False
Education Level    False
dtype: bool

In [9]:
customers[customers.isna().any(axis=1)]

      Name   Age  Followers     Income Sign Up Date Discount  Education Level
2  Harmony  26.0        NaN  $120,000       4/25/23       No  Graduate School
3   Melody  47.0        NaN  $450,000        5/5/23       No          College
5   Selena   NaN        1.0   $62,000       8/26/23       No          College
6  Stefani   NaN        NaN   $81,000       9/24/23       No          College

#### handling missing values

In [12]:
# dropna

customers.dropna().reset_index(drop=True)

     Name   Age  Followers    Income Sign Up Date Discount Education Level
0    Aria  25.0        0.0  $45,000       5/18/23      Yes         College
1   Chord  19.0       12.0  $28,000       8/23/23      Yes     High School
2    Reed  52.0        0.0  $75,000       6/14/23      Yes     High School
3  Taylor  33.0       52.0  $60,000        9/8/23       No     High School

In [13]:
# save 

customers_dropped = customers.dropna().reset_index(drop = True)
customers_dropped.isna().any()

Name               False
Age                False
Followers          False
Income             False
Sign Up Date       False
Discount           False
Education Level    False
dtype: bool

In [14]:
# fillna 

customers.isna().any()

Name               False
Age                 True
Followers           True
Income             False
Sign Up Date       False
Discount           False
Education Level    False
dtype: bool

In [23]:
# fill age

print(f'median age: {customers.Age.median()}')

customers['Age']=customers['Age'].fillna(round(customers['Age'].median()))

customers['Age']

median age: 29.5

0    25.0
1    19.0
2    26.0
3    47.0
4    52.0
5    30.0
6    30.0
7    33.0
Name: Age, dtype: float64

In [24]:
# fill followers (check with domain experts)
print(f'followers: {customers.Followers}')

customers['Followers'] = customers['Followers'].fillna(0)
customers['Followers']

followers: 0     0.0
1    12.0
2     NaN
3     NaN
4     0.0
5     1.0
6     NaN
7    52.0
Name: Followers, dtype: float64

0     0.0
1    12.0
2     0.0
3     0.0
4     0.0
5     1.0
6     0.0
7    52.0
Name: Followers, dtype: float64

In [25]:
customers.isna().any()

Name               False
Age                False
Followers          False
Income             False
Sign Up Date       False
Discount           False
Education Level    False
dtype: bool